fraserb99/ee579-msp430/Group Project/main.c
#include <msp430.h> 


/**
 * main.c for Group 4
 *
 * Main file for the EE579 Advanced Microcontroller Applications
 * Created by Group 4.
 *
 * Code in here is based on previous challenges and examples from TI code
 *
 * Includes all functionality for Inputs and Outputs specified in the design
 * document (2 buttons, 1 potentiometer, 1 thermometer, 3 lights, and 1 buzzer
 *
 * Timers are allocated dynamically based on activation of function (input/output)
 * For any initialisation in the same occurrence of a while loop the functionalities
 * will be allocated timers depending on order of first encounter ie :
 * Button 1, Button 2, Potentiometer, Thermometer, LED 1, LED 2, LED 3, Buzzer and
 * their related configurations.
 * The exact order of these can be found in the while loop in the main function.
 */

/**
 * Setup of global variables and constants, specified based on functionality
 */

/**
* sending messages
* first row is flag, second is value to send, codes for index:
* 0 = error, 1 = button, 2 = button2, 3 = potentiometer, 4 = temperature
*
* for error if value is 1 - generic, if value is 2 - no more timers, 3 - clashing rules
*/
int send[2][5] = {{0, 0, 0, 0, 0},
                  {0, 0, 0, 0, 0}};
unsigned int send_message = 0;                  //flag used to indicate that at least one message needs to be sent

/**
 * Description of codes used for the timers, A0_0 is reserved for UART
 * for those with 1 timer:
 * A0_1 = 1, A0_2 = 2, A1_0 = 3, A1_1 = 4, A1_2 = 5
 *
 * For 2 timers:
 * A0_1 +          A1_0 +          A1_1 +
 *    A0_2 = 10,      A1_1 = 11,      A1_2 = 13,
 *                    A1_2 = 12,
 *
 */

/**
 * inputs
 * The codes for activation are based on the timers, if value is 0 that means not active, if -1 means disable/deactivate
 * for the outputs this usually means turning off what ever function was used (light. buzzer) the only exception is the
 * fading in lights which only disable timers and resets the variable, the light will still stay on and this needs to be manually turned off
 * if testing (messages received will do this automatically
 */

//Button 1
signed int button = 0;                          //Button variable, depends on timer used
unsigned int b_activated = 0;                   //boolean for denoting button activation
unsigned int timer_count = 0;                   //initial count for the wait time
unsigned int pressed = 0;                       //checking for pressed state, used for debouncing
unsigned int held = 0;                          //checking if the button is being pressed/held
const int debounce_b = 328;                     //count for the 50Hz, based on 32768/(2*x)= 50, want a 20ms wait for the debouncing, 1/20*10^-3 = 50
const int count_b = 820;                        //count for the count for presses, rate of 20Hz, based on 32768/(2x) = 20Hz
int activated_button[];                         //indicator for activated timer for the button

//Button 2
signed int button2 = 0;                         //Button 2
unsigned int b2_activated = 0;                  //button 2 activation
unsigned int timer_count2 = 0;                  //initial count for the wait time
unsigned int pressed2 = 0;                      //checking for pressed state, used for debouncing
unsigned int held2 = 0;                         //checking if the button is being pressed/held
const int debounce_b2 = 164;                    //count for the 100Hz, based on 32768/(2*x)= 100, want a 10ms wait for the debouncing, 1/20*10^-3 = 50
const int count_b2 = 820;                       //count for the count for presses, rate of 20Hz, based on 32768/(2x) = 20Hz
int activated_button2[];                        //indicator for activated timer for the button

//Potentiometer
signed int pot = 0;                             //Potentiometer use
unsigned int pot_activated = 0;                 //boolean for denoting potentiometer activation
unsigned int orig_val = 0;                      //Setting up value for original potentiometer vale
unsigned int value = 0;                         //value on check/compare to original value
signed int change = 0;                          //value to check how much the potentiometer value has changed
const int step_size = 100;                      //value to indicate step size, set as a constant
unsigned int stable_pot = 0;                    //used to check first value after stabilisation timers
unsigned int sample_pot = 0;                    //used to denote if pot should be sampled
const int sample_time = 328;                    //sample every 20ms, based on 32768/2x = 50Hz
int activated_pot[];                            //array used for timer activation and deactivation

//Thermometer
signed int thermometer = 0;                     //thermometer use
unsigned int t_activated = 0;                   //boolean for denoting thermometer activation
signed int orig_temp = 0;                       //Setting up value for original potentiometer vale
signed int value_temp = 0;                      //value on check
unsigned int temp = 0;                          //temporary held value before calculation
signed long change_t = 0;                       //value to check how much the temp has changed
const int step_size_t = 2;                      //value to indicate step size, as error is +- 2 step size is set to 2 for more stable operation
unsigned int stable = 0;                        //boolean for determining if stable Vref
unsigned int sample_temp = 0;                   //boolean to be used to indicate a sample should be taken
const int sample_temp_time = 16384;             //used for sample time of the temperature, every second (1Hz)
int activated_temp[];                           //indicator for activated timer for the temperature

/**
 * Outputs
 * variables and constants for breathing and fading lights, same for all LEDs independent of user defined speeds
 */
signed int max_brightness = 32;                 //used for checking max value for brightness and counter value, based on single light
signed int change_period = 16;                  //period for flashing and breathing, default values, based on single light
const int max_brightness1 = 32;                 //Values used for this, used for 1 blinking light
const int change_period1 = 16;                  //values for the period
const int max_brightness2 = 16;                 //values for more than 1 breathing light
const int change_period2 = 8;                   // >1 breathing light
const int brightness_register_1 = 4096;         //used for brightness increment timing, 1Hz, first setting
const int brightness_register_2 = 2048;         //used for brightness increment timing, 2Hz, second setting
const int brightness_register_3 = 1024;         //used for brightness increment timing, 4Hz, third setting

