fraserb99/ee579-msp430/Group Project/main.c
//LED1
signed int led1_on = 0;                         //LED D1 on, 0 indicate off, -1 - deactivate
unsigned int led1_active = 0;                   //check if the light has been activated - can only have one setting on at a time
unsigned int led1_fo_active = 0;                //own activation check for fade out as that can turn lights of that are on, if wanted
signed int led1_blink = 0;                      //LED1 blinking light
signed int led1_fade_in = 0;                    //LED1 fade in
signed int led1_fade_out = 0;                   //LED1 fade out
signed int led1_breath = 0;                     //LED1 blinking light
unsigned int blink_rate_1 = 16384;              //rate for the blinking light of LED D1, default period 1Hz
unsigned int light_flag_1 = 0;                  //breathing and fading light flag, brighter or darker,  brighter = 0, darker = 1;
unsigned int brightness_1 = 0;                  // Varies brightness between 0 and 32
unsigned int counter_val_1 = 0;                 //counter for the LED on time
unsigned int period_1 = 2048;                   //overall period for the fading and breathing light, default is 2Hz
int activated_led1[];                           //Array for activated timers for LED D1

//LED2
signed int led2_on = 0;                         //LED D2 on
unsigned int led2_active = 0;                   //LED2 active
unsigned int led2_fo_active = 0;                //own activation check for fade out as that can turn lights of that are on, if wanted
signed int led2_blink = 0;                      //LED2 blink
signed int led2_fade_in = 0;                    //LED2 fade in
signed int led2_fade_out = 0;                   //LED2 fade out
signed int led2_breath = 0;                     //LED2 breathing light
unsigned int blink_rate_2 = 16384;              //rate for the blinking light of LED D2, default period 1Hz
unsigned int light_flag_2 = 0;                  //breathing and fading light flag, brighter or darker,  brighter = 0, darker = 1;
unsigned int brightness_2 = 0;                  //varies brightness between 0 and 32
unsigned int counter_val_2 = 0;                 //LED counter
unsigned int period_2 = 2048;                   //period for flashing and breathing, default
int activated_led2[];                           //Array for activated timers for LED D2

//LED3
signed int led3_on = 0;                         //LED D3 on/off, colour light
unsigned int led3_active = 0;                   //LED3 active
unsigned int led3_fo_active = 0;                //own activation check for fade out as that can turn lights of that are on, if wanted
signed int led3_rot = 0;                        //rotate led3
signed int led3_dir = 0;                        //LED3 direction of rotation, -1 for backwards and 1 for forwards
signed int led3_blink = 0;                      //LE3 blink
unsigned int led3_blink_on = 0;                 //used to indicate on or off light
signed int led3_fade_in = 0;                    //LED3 fade in
signed int led3_fade_out = 0;                   //LED3 fade out
signed int led3_breath = 0;                     //LED3 blinking light
//define all the colours, based on improved code from past assignments
#define RED (BIT1)
#define GREEN (BIT3)
#define BLUE (BIT5)
#define YELLOW (BIT1 + BIT3)
#define PURPLE (BIT1 + BIT5)
#define WHITE (BIT1 + BIT3 + BIT5)
const int colours[] = {RED, GREEN, BLUE, YELLOW, PURPLE, WHITE};    //Array for the colours
unsigned int colour = 0;                        //The colour selected
unsigned int blink_rate_3 = 16384;              //rate for the blinking light for LED D3, or rotating, default 1Hz
signed int light_flag_3 = 0;                    //breathing and fading light flag, brighter or darker,  brighter = 1, darker = -1;
signed int brightness_3 = 0;                    //used for determining brightness, initially between 0 and 4
unsigned int flash_count_3 = 0;                 //LED counter
unsigned int counter_val_3 = 1;                 //duty cycle for breathing and flashing, default of 2048Hz
unsigned int period_3 = 2048;                   //period for flashing and breathing, default of 16Hz
int activated_led3[];                           //Array for activated timers for the colour led

//Buzzer
signed int buzzer_tone = 0;                     //buzzer on, for specific period
signed int buzzer_beep = 0;                     //buzzer beeping
unsigned int buzzer_active = 0;                 //boolean for indicating that the buzzer has been activated/is being used
unsigned int buzzer_on = 0;                     //boolean used for indicating if the buzzer is on during the beep one
unsigned int buzzer_duration = 2000;            //buzzer duration, in ms, will be divided to closest 100ms, 2000 is default
unsigned int buzzer_duration_off = 1000;        //second buzzer duration for the beeping, off period, to nearest 100ms, 1000 is default
unsigned int buzzer_count = 0;                  //counter variable for the on period of the buzzer
const int buzzer_period = 82;                   //timer for counting the required on period, 50ms = 20Hz
int activated_buzzer[];                         //Array for activated timer for the buzzer

/**
 * array for timer usage, 0 if not used, 1 if used 0, second row is to indicate how many functions are using the timers
 * buttons needs their own and are therefore -1 if they are using the timer ie second row value is -1
 * position as timer codes, UART holds A0_0, it is included here to verify UART timing, and to assist in timer denotions as specified previously
 */

signed int timers_used[2][6] = {{0, 0, 0, 0, 0, 0},
                                {0, 0, 0, 0, 0, 0}};
unsigned int timer0_activated = 0;              //Boolean used for checking if TA0 has been activated
unsigned int timer1_activated = 0;              //Boolean used for checking if TA1 has been activated
signed int activated_timers[2] = {-1, -1};      //array for activated timers for each activation

/**
 * Array for used lights If 1 means active, if 0 not active, for the breathing lights
 * Returns array of status for each light, pos0 = D1, pos1 = D2, pos3 = D3
 */
unsigned int lights_used[3] = {0, 0, 0};

//Helper Function Declaration, the functions are located at the bottom of the file
int activate_timer(int timer_no, int count);                        //function for activating a specific timer
int activate_free_timer(int registers, int counts[], int alone);    //function for activating required number of free timers
void deactivate_timer(int activated[], int len);                    //deactivate unused timers
int get_timer_code(int timers[]);                                   //get the specific timer code for 2 timers
void check_breath(int on);                                          //function to check current active breathing lights to change period for increased numbers

