fraserb99/ee579-msp430/Group Project/main.c
//main function
int main(void)
 {
    //Base set up
	WDTCTL = WDTPW | WDTHOLD;	// stop watchdog timer


	/**
	 * Variables for testing
	 * Un-comment the features wanted, then select debug and run. Ensure all external devices are
	 * connected as per the diagram in the design specifications as these will not function otherwise.
	 *
	 * For features connected to inputs the required affecting output needs to be specified
	 * in the timer code for each corresponding input, these can be found in the timer interrupts later
	 * in this file. It is not necessary to specify the wanted output for each timer interrupt,
	 * these are dynamically allocated base on available timers and will therefore allocate the
	 * inputs based on the order in the list below, therefore for example if button 1 was selected,
	 * along with button 2. on this run Button 1 would be allocated Timer A0_1 and button 2 A0_2,
	 * therefore any required output should be activated in those corresponding timers.
	 * If only Button 2 was selected then this would be allocated A0_1.
	 *
	 * Please note that while any inputs wanted can be selected at once, however this will affect
	 * the timers and hence the availability of the outputs as there are only a possible number
	 * of 5 timer Capture Compare Registers of which 1 is required per each input, and a mix of
	 * 1 and 2 CCR for the outputs depending on functionality, please see the list below for details.
	 * LED is used without a digit here as it is the same for all LEDs
	 *
	 * Those with 1 CCR: LED blink, Buzzer Tone, Buzzer Beep
	 * Those with 2: LED fade in, LED Fade out, LED breathing
	 *
	 * Please note that Buzzer Tone, Fade in, and Fade out will deactivate their timer upon task completion.
	 * Fade In will still remain on after this activation.
	 * Default durations are set in the variable declaration above, the duration is specified in the comments.
	 *
	 * To deactivate any input or output simply assign them a value of -1. For Fading In, as specified,
	 * the light will remain active and this can be turned off in 2 different ways: Set fade out to 1,
	 * set led on to -1.
	 *
	 */

	//Inputs
	//button = 1;           //Button 1
	//button2 = 1;          //Button 2
	//pot = 1;              //Potentiometer
	//thermometer = 1;      //Thermometer

	//Outputs, these can be activated here or copied over to the timer interrupts to be activat3ed by input events
	//led1_on = 1;          //LED D1 (green) on, to turn off assign value -1
	//led1_blink = 1;       //LED D1 blink at default rate, this rate can be altered by altering the blink_rate_1 variable
	//led1_fade_in = 1;     //LED D1 fade in at default rate, this can be specified by assigning one of the blink_rate variables to period_1
	//led1_fade_out = 1'     //LED D1 fade out at default rate, can be specified in the same manner as fade in
	//led1_breath = 1;      //LED D1 breathing light, at default rate, can be specified in the same manner as fade

	//led2_on = 1;          //LED D2 (red) on, to turn off assign value -1
    //led2_blink = 1;       //LED D2 blink at default rate, this rate can be altered by altering the blink_rate_2 variable
    //led2_fade_in = 1;     //LED D2 fade in at default rate, this can be specified by assigning one of the blink_rate variables to period_2
    //led2_fade_out = 1'     //LED D2 fade out at default rate, can be specified in the same manner as fade in
    //led2_breath = 1;      //LED D2 breathing light, at default rate, can be specified in the same manner as fade

	//led3_on = 1;          //LED D3 colour can be specified by setting a number between 0 and 5, on, to turn off assign value -1
    //led3_rot = 1;         //LED D3 rotating light, direction is determined by dir, if dir = 0 then no rotation will take place dir = 1 is forward and dir = -1 backwards
	//led3_blink = 1;       //LED D3 blink at default rate, this rate can be altered by altering the blink_rate_2 variable, if dir is set to 1 or -1 this will also rotate
    //led3_fade_in = 1;     //LED D3 fade in at default rate, this can be specified by assigning one of the blink_rate variables to period_3
    //led3_fad_out = 1'     //LED D3 fade out at default rate, can be specified in the same manner as fade in
    //led3_breath = 1;      //LED D3 breathing light, at default rate, can be specified in the same manner as fade, if dir is set this will rotate
	//led3_dir = 1          //Used to set rotation direction for LED 3,

	//buzzer_tone = 1;      //Buzzer on for a specific duration, currently default duration, this can be specified by setting the buzzer_duration variable
	//buzzer_beep = 1;      //Buzzer beeping until stopped (highly recommended to use this in conjunction with an input to stop it as buzzer_beep needs to be set to -1 to deactivate
	                        //On duration and off duration of the beeps is set separately, currently default, can be changed by setting buzzer_duration, and buzzer_duration_off


	//UART initialisation
    //reserve timer A0_0 for UART, arbitrary nr for now:
    //returns 1 on success
    int uart_timer = activate_timer(0, 16384);
    //want it to be reserved
    timers_used[1][0] = -1;

    if(uart_timer != 1){
        //error occurred
        send_message = 1;
        send[0][0] = 1; //set flag
        send[1][0] = 1; //generic error

    }


    //Set unused pins to output direction, P1.7
    P1DIR |= BIT7;
    //P2.0, 2.6 and 2.7
    P2DIR |= BIT0 + BIT6 + BIT7;


	__bis_SR_register(GIE);                     //interrupt enabled

	//While loop for continuous running
    while(1){
        //read messages here


        //sending messages, based on set flags
        if(send_message){ //there is a message to send
            unsigned int i, to_send, value;
            for(i=0; i<5; i++){ //loop through and check for flag

                if(send[0][i] == 1){ //if the flag is set
                    to_send = i;      //say which one to send
                }

                switch(to_send){
                case 0:
                    //send error message here
                    //value = send[1][0]
                    //reset flag
                    send[0][0] = 0;
                    break;
                case 1:
                    //send message for button
                    //value is the time the button has been pressed for
                    //counts every 50ms so multiply by 50, to get total time in ms
                    value = send[1][1]*50;
                    //reset flag
                    send[0][1] = 0;
                    break;
                case 2:
                    //send message for second button, hold time in ms
                    value = send[1][2]*50;
                    send[0][2] = 0;
                    break;
                case 3:
                    //send message for potentiometer
                    //value stored in send[1][3]
                    send[0][3] = 0;
                    break;
                case 4:
                    //send message for temperature, in degrees C
                    //value stored in send[1][4]
                    send[0][4] = 0;
                    break;
                default:
                    //something went wrong
                    break;
                }
            }
            //reset the send message flag
            send_message = 0;
        }


        /**
         * Activation of inputs
         */

        /**
         * Button activation, selects first available timer
         */
        if (button > 0){
            if (!b_activated){ //if not already activated
                //button set up, from slides and previous challenge
                P1OUT |= BIT3;                        //pull up resistor on P1.3
                P1REN |= BIT3;                        //Enable it
                P1IES |= BIT3;                        //high to low edge
                P1IFG &= ~BIT3;                       //Clear flag
                P1IE |= BIT3;                         //Interrupt enable

