fraserb99/ee579-msp430/Group Project/main.c
                int counts[1] = {debounce_b};         //array set up for wanted CCR counts, set for debounce
                b_activated = activate_free_timer(1, counts, -1); //activate free timer, needs to be alone
                //record which ones were activated
                activated_button[0] = activated_timers[0];
                button = activated_button[0];            //assign to check properly for timer interrupts
                if (b_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //send error
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic error
                    //disable button, no timer was activated
                    button = 0;
                    b_activated = 0;
                } else {
                        //turn of the timer for now, still being used, just doesn't need to trigger constantly, triggers by button press
                    switch (button){
                    case 1:
                        TA0CCR1 = 0;
                        break;
                    case 2:
                        TA0CCR2 = 0;
                        break;
                    case 3:
                        TA1CCR0 = 0;
                        break;
                    case 4:
                        TA1CCR1 = 0;
                        break;
                    case 5:
                        TA1CCR2 = 0;
                        break;
                    default:
                        //something went wrong, send error
                        send_message = 1;
                        send[0][0] = 1; //set flag
                        send[1][0] = 1; //generic error
                        button = -1; //disable button as wrong timer used
                        break;
                    }
                }

            }
        } else if(button == -1){    //disable the button
            b_activated = 0;                        //no longer active
            deactivate_timer(activated_button, 2);  //turn off timer
            P1IE &= ~BIT3;                          //and button interrupt
            P1REN |= BIT3;                          // and disable the pullup/pulldown
            button = 0;                             //set to default (off)
        }


        /**
         * Button 2, code copied from button 1, altered for correct pins
         */
        if (button2 > 0){
            if (!b2_activated){ //if not already activated
                P1OUT |= BIT5;                            //pull up resistor on P1.5
                P1REN |= BIT5;                            //Enable it
                P1IES |= BIT5;                            //high to low edge
                P1IFG &= ~BIT5;                           // Clear flag
                P1IE |= BIT5;                             //Interrupt enable

                int counts[1] = {debounce_b2};
                b2_activated = activate_free_timer(1, counts, -1); //single timer, alone
                //record which ones were activated
                activated_button2[0] = activated_timers[0];
                button2 = activated_button2[0];                //assign to check properly for timer interrupts
                if (b2_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //send error
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic error
                    //disable button
                    button2 = 0;
                    b2_activated = 0;
                } else {
                    //turn of the timer for now
                    switch (button2){
                    case 1:
                        TA0CCR1 = 0;
                        break;
                    case 2:
                        TA0CCR2 = 0;
                        break;
                    case 3:
                        TA1CCR0 = 0;
                        break;
                    case 4:
                        TA1CCR1 = 0;
                        break;
                    case 5:
                        TA1CCR2 = 0;
                        break;
                    default:
                        //Something went wrong, send generic error message
                        send_message = 1;
                        send[0][0] = 1; //set flag
                        send[1][0] = 1; //generic error
                        button2 = -1; //disable button
                        break;
                    }
                }
            }

        } else if(button2 == -1){
            b2_activated = 0;                        //if button is no longer requested
            deactivate_timer(activated_button2, 2);   //turn off timer
            P1IE &= ~BIT5;                          //and button interrupt
            P1REN |= BIT5;                          // and disable the pullup/pulldown
            button2 = 0;
        }

        /**
         * Potentiometer, samples every 20ms, activates first available timer
         */
        if (pot > 0){
            if(!pot_activated){         //if not already activated
                ///based on previous assignments
                ADC10CTL0 = ADC10ON + CONSEQ_0 + SREF_0; // ADC10ON, single channel single sample, ref 0
                ADC10CTL1 = INCH_4 + ADC10SSEL_1;          // input A4, clock = ACLK
                ADC10AE0 |= BIT4;                          // PA.4 ADC option select

                int counts[1] = {10}; //stabilisation count
                pot_activated = activate_free_timer(1, counts, 0); //single timer, doesn't need to be alone
                activated_pot[0] = activated_timers[0];      //record which ones were activated
                pot = activated_pot[0];              //Set for proper check in interrupts
                if (pot_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable pot
                    pot = 0;
                    pot_activated = 0;
                } else {
                    stable_pot = 0;
                    sample_pot = 0;
                }
            } else {
                if(sample_pot) { //if sample is requested
                    if(t_activated){ //if thermometer is used as well
                        ADC10CTL0 = ADC10ON  + SREF_0;  //set ref to 0
                        ADC10CTL1 = INCH_4;             //Ensure right channel
                        ADC10AE0 |= BIT4;               // PA.4 ADC option select
                        ADC10CTL0 &= ~REFON;            //turn of reference

                        ADC10CTL0 |= ENC + ADC10SC;     // Sampling and conversion start
                        //ADC10MEM = conversion result
                        while ((ADC10CTL0 & ADC10IFG) == 0) {//wait for flag
                            //Wait for sample to take place
                        }
                        value = ADC10MEM;           //Just to make sure the value doesn't change during checking
                        //disable conversion
                        ADC10CTL0 &= ~ENC;
                        //clear flag
                        ADC10CTL0 &= ~ADC10IFG;

                    } else { //on its own, no need to reset INCH and SREF

                        ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                        //ADC10MEM = conversion result
                        //wait for result completion,
                        while ((ADC10CTL0 & ADC10IFG) == 0) {//wait for flag
                            //Wait for sample to take place
                        }
                        value = ADC10MEM;           //Just to make sure the value doesn't change during checking

                        //clear flag
                        ADC10CTL0 &=  ~ADC10IFG;

