fraserb99/ee579-msp430/Group Project/main.c
                    }

                    if(value != orig_val){ //if value has changed
                        //check by how much
                        change = abs(orig_val - value);

                        if (change >= step_size){ //if by wanted step size or more
                            //send message
                            send_message = 1;
                            send[0][3] = 1; //set flag
                            send[1][3] = value; //value of pot

                            //change to new orig value
                            orig_val = value;
                            //testing light, need to be activated by setting P1DIR |= BIT6
                            //P1OUT ^= BIT6;
                        }

                    }

                    sample_pot = 0; //finished sampling, ready for another
                }
            }

        } else if(pot == -1){
            deactivate_timer(activated_pot, 1);
            pot_activated = 0;
            pot = 0;
        }

        /**
         * Thermometer, samples every second, activates first available timer
         * currently does not work when potentiometer is requested (changes when the potentiometer changes) making value invalid
         */
        if(thermometer > 0){
            //based on example adc10_temp.c from URL: http://dev.ti.com/tirex/explore/node?node=AEldOKIXgnT979MckUlLRw__IOGqZri__LATEST
            if(!t_activated){
                ADC10CTL0 = ADC10ON + SREF_1 + REFON + CONSEQ_0; // ADC10ON, vr+ = Vref+f, Vr- = Vss, reference on, ref 1
                ADC10CTL1 = INCH_10 + ADC10SSEL_1;    // temp sensor, clock = ACLK

                //set up a timer for stabilisation, use A1
                //need a stabilisation nr, only need 1 timer
                int counts[1] = {30};
                t_activated = activate_free_timer(1, counts, 0); //single timer, doesn't need to be alone
                activated_temp[0] = activated_timers[0];      //record which ones were activated
                thermometer = activated_temp[0];              //Set for proper check in interrupts
                if (t_activated != 1) { //if return is 1, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable temp
                    thermometer = 0;
                    t_activated = 0;
                } else {
                    stable = 0;
                }
            }

            if (sample_temp){ //is sample was requested
                if(pot_activated){ //check if potentiometer is being used at the same time
                    //if pot is active reset these every time
                    ADC10CTL0 = ADC10ON + SREF_1 + REFON;
                    ADC10CTL1 = INCH_10;
                    ADC10AE0 &= ~BIT4;      //reset ADC input

                    ADC10CTL0 |= ENC + ADC10SC;         // Sampling and conversion start
                    //based on code for pot above
                    while ((ADC10CTL0 & ADC10IFG) == 0) {//wait for flag
                        //Wait for sample to take place
                    }
                    temp = ADC10MEM;           //Just to make sure the value doesn't change during checking
                    //disable conversion, to allow for reset of values
                    ADC10CTL0 &= ~ENC;
                    //clear flag
                    ADC10CTL0 &= ~ADC10IFG;

                } else {
                    ADC10CTL0 |= ENC + ADC10SC;         // Sampling and conversion start
                    //based on code for pot above
                    while ((ADC10CTL0 & ADC10IFG) == 0) {//wait for flag
                        //Wait for sample to take place
                    }
                    temp = ADC10MEM;           //Just to make sure the value doesn't change during checking

                    //clear flag
                    ADC10CTL0 &= ~ADC10IFG;
                }

                value_temp = ((temp - 673) * 423) / 1024;

                if(value_temp != orig_temp){ //if value has changed
                    //check by how much
                    change_t = abs(orig_temp - value_temp);

                    if (change_t >= step_size_t){
                        //send message
                        send_message = 1;
                        send[0][4] = 1; //set flag
                        send[1][4] = value_temp; //temp value
                        //change to new orig value
                        orig_temp = value_temp;
                        //testing light, need to be activated by setting P1DIR |= BIT0
                        //P1OUT ^= BIT0;
                    }
                }

                //set sample to false
                sample_temp = 0;
            }

        } else if(thermometer == -1){
            t_activated = 0;
            deactivate_timer(activated_temp, 1);
            thermometer = 0;
        }


        /**
         * Outputs activation
         */

        /**
         * LED 1, turning it on, to turn off assign -1
         */
        if(led1_on == 1){
            if (!led1_active) {
              P1DIR |= BIT0;        // P1.0 output
            }

            //turn on LED D1
            P1OUT |= BIT0;
            //set the value to 0
            led1_on = 0;

        } else if(led1_on == -1) {
            P1OUT &= ~BIT0;         //turn light off
            led1_active = 0;        //not active anymore
            led1_on = 0;
        }

        /**
         * LED 1 blinking light, activates first available timer
         */
        if(led1_blink > 0){
            if(!led1_active){
                P1DIR |= BIT0;
                //need a timer for the blinking, only 1
                int counts[1] = {blink_rate_1};
                led1_active = activate_free_timer(1, counts, 0); //1 timer, doesn't need to be alone
                activated_led1[0] = activated_timers[0]; //record which ones were activated
                led1_blink = activated_led1[0];
                if (led1_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    //send generic error message
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the led
                    led1_blink = 0;
                    led1_active = 0;
                }
                //toggle LED D1
                P1OUT ^= BIT0;
            }

