fraserb99/ee579-msp430/Group Project/main.c
        } else if (led1_blink == -1){
            led1_active = 0;
            P1OUT &= ~BIT0;
            deactivate_timer(activated_led1, 1);
            led1_blink = 0;
        }

        /**
         * LED 1 Fade in, allocates timer if 2 CCR are available in the same timer, else will not activate, will send error if this happens
         */
        if(led1_fade_in > 0){
            if(!led1_active){
                P1DIR |= BIT0;
                P1OUT &= ~BIT0; //don't want it on
                //need 2 timers for the fading in, doesn't need to be alone
                int counts[2] = {change_period, period_1};
                led1_active = activate_free_timer(2, counts, 0);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_fade_in = get_timer_code(activated_led1);
                if (led1_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    //send generic error message
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the fade in
                    led1_fade_in = 0;
                    led1_active = 0;
                } else {
                    light_flag_1 = 0; //reset this
                    counter_val_1 = 0; //and this
                }

            }

        } else if (led1_fade_in == -1){
            //led1_active = 0; - light is still active
            deactivate_timer(activated_led1, 2);
            led1_fade_in = 0;
        }

        /**
         * LED 1 fade out, allocates timer in the same manner as fade in
         */
        if(led1_fade_out > 0){
            if(!led1_fo_active){ //if light hasn't been activated, or if on
                P1DIR |= BIT0;
                //need 2 timers for the fading in, doesn't need to be alone
                int counts[2] = {change_period, period_1};
                led1_fo_active = activate_free_timer(2, counts, 0);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_fade_out = get_timer_code(activated_led1);
                if (led1_fo_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the fade out
                    led1_fade_out = 0;
                    led1_fo_active = 0;
                    led1_active = 0;
                } else {
                    led1_active = 1; //led is being used

                    //set the brightness to max
                    brightness_1 = max_brightness;
                    light_flag_1 = 1;
                    counter_val_1 = 0; //reset this
                    //need to turn on a light first, if not already on
                    P1OUT |= BIT0;
                }

            }

        } else if (led1_fade_out == -1){
            led1_fo_active = 0;
            led1_active = 0;
            P1OUT &= ~BIT0;
            deactivate_timer(activated_led1, 2);
            led1_fade_out = 0;
        }

        /**
         * LED 1 breathing light, allocates timers in the same manner as fading lights,
         * will share timer with other breathing lights if active at the same time
         */
        if(led1_breath > 0){
            if(!led1_active){
                P1DIR |= BIT0;
                //check active breathing lights, for on
                check_breath(1);
                //need 2 timers for the breathing light
                int counts[2] = {change_period, period_1};
                led1_active = activate_free_timer(2, counts, 0);
                activated_led1[0] = activated_timers[0]; //record which ones were activated, first
                activated_led1[1] = activated_timers[1]; //record second one
                led1_breath = get_timer_code(activated_led1);
                if (led1_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the breathing light
                    led1_breath = 0;
                    led1_active = 0;
                } else {
                     light_flag_1 = 0;       //ensure increasing brightness first
                     counter_val_1 = 0;      //and counter val 0
                     lights_used[0] = 1;    //indicate it is now active
                }

            }

        } else if (led1_breath == -1){
            led1_active = 0;
            P1OUT &= ~BIT0;
            deactivate_timer(activated_led1, 2);
            led1_breath = 0;
            lights_used[0] = 0;
            //need to check if there is now only 1 breathing light
            check_breath(0);
        }

        /**
         * LED 2 code, based on that of LED 1
         *
         * LED 2 on
         */
        if(led2_on == 1){
            if (!led2_active) {
              P1DIR |= BIT6;        // P1.6 output
            }
            //turn on LED D2
            P1OUT |= BIT6;
            led2_on = 0;

        } else if(led2_on == -1){
            P1OUT &= ~BIT6;         //turn light off
            led2_active = 0;        //not active anymore
            led2_on = 0;
        }

        /**
         * LED 2 blinking light, allocates fist available timer
         */
        if(led2_blink > 0){
            if(!led2_active){
                P1DIR |= BIT6;
                //need a timer for the blinking, only 1
                int counts[1] = {blink_rate_1};
                led2_active = activate_free_timer(1, counts, 0);
                activated_led2[0] = activated_timers[0]; //record which ones were activated
                led2_blink = activated_led2[0];
                if (led2_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the blinking light
                    led2_blink = 0;
                    led2_active = 0;
                }
                //toggle LED D2
                P1OUT ^= BIT6;
            }

        } else if (led2_blink == -1){
            led2_active = 0;
            P1OUT &= ~ BIT6;
            deactivate_timer(activated_led2, 1);
            led2_blink = 0;
        }

        /**
         * LED 2, timer allocation as LED 1 fading lights
         */
        if(led2_fade_in > 0){
            if(!led2_active){
                P1DIR |= BIT6;
                P1OUT &= ~BIT6; //don't want it on
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_2};
                led2_active = activate_free_timer(2, counts, 0);
                activated_led2[0] = activated_timers[0]; //record which ones were activated, first
                activated_led2[1] = activated_timers[1]; //record second one
                led2_fade_in = get_timer_code(activated_led2);
                if (led2_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the fade in
                    led2_fade_in = 0;
                    led2_active = 0;
                } else {
                    light_flag_2 = 0; //reset light flag
                    counter_val_2 = 0;
                }

