fraserb99/ee579-msp430/Group Project/main.c
            }

        } else if (led2_fade_in == -1){
            //led2_active = 0; - light is still active
            //P1OUT &= ~BIT6;
            deactivate_timer(activated_led2, 2);
            led2_fade_in = 0;
        }

        /**
         * LED 2 fade out
         */
        if(led2_fade_out > 0){
            if(!led2_fo_active){ //if light hasn't been activated, or if on
                P1DIR |= BIT6;
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_2};
                led2_fo_active = activate_free_timer(2, counts, 0);
                activated_led2[0] = activated_timers[0]; //record which ones were activated, first
                activated_led2[1] = activated_timers[1]; //record second one
                led2_fade_out = get_timer_code(activated_led2);
                if (led2_fo_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong'=
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the fade out
                    led2_fade_out = 0;
                    led2_fo_active = 0;
                    led2_active = 0;
                } else {
                    led2_active = 1; //led is being used
                    //for testing
                    //P1OUT ^= BIT6;
                    //set the brightness to max
                    brightness_2 = max_brightness;
                    light_flag_2 = 1;
                    counter_val_2 = 0;
                    //need to turn on a light first, if not already on
                    P1OUT |= BIT6;
                }

            }

        } else if (led2_fade_out == -1){
            led2_fo_active = 0;
            led2_active = 0;
            P1OUT &= ~BIT6;
            deactivate_timer(activated_led2, 2);
            led2_fade_out = 0;
        }

        /**
         * LED 2 breathing light
         */
        if(led2_breath > 0){
            if(!led2_active){
                P1DIR |= BIT6;
                check_breath(1); //on
                //need 2 timers for the breathing light
                int counts[2] = {change_period, period_2};
                led2_active = activate_free_timer(2, counts, 0);
                activated_led2[0] = activated_timers[0]; //record which ones were activated, first
                activated_led2[1] = activated_timers[1]; //record second one
                led2_breath = get_timer_code(activated_led2);
                if (led2_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the breathing light
                    led2_breath = 0;
                    led2_active = 0;
                } else {
                    light_flag_2 = 0;
                    counter_val_2 = 0;
                    lights_used[1] = 1;
                }

            }

        } else if (led2_breath == -1){
            led2_active = 0;
            P1OUT &= ~BIT6;
            deactivate_timer(activated_led2, 2);
            led2_breath = 0;
            lights_used[1] = 0;
            //check lights
            check_breath(0);
        }

        /**
         * LED 3, based on LED 1 but with added functionality of colour selection
         */
        if(led3_on == 1){
            if (!led3_active) {
              P2DIR |= BIT1 + BIT3 + BIT5;        // P1.0 output
            }

            //LED D3, on set colour
            P2OUT = colours[colour];
            led3_on = 0;

        } else if(led3_on == -1){
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            led3_active = 0;                    //not active anymore
            led3_on = 0;
        }

        /**
         * LED 3 rotating light, first available timer will be allocated
         */
        if(led3_rot > 0){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need a timer for the rotation speed, only 1
                int counts[1] = {blink_rate_3};
                led3_active = activate_free_timer(1, counts, 0);
                activated_led3[0] = activated_timers[0]; //record which ones were activated
                led3_rot = activated_led3[0];
                if (led3_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the rotation light
                    led3_rot = 0;
                    led3_active = 0;
                } else {
                    //toggle LED D3, wanted colour
                    P2OUT = colours[colour];
                }
            }

        } else if(led3_rot == -1){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            deactivate_timer(activated_led3, 1);
            led3_rot = 0;

        }

        /**
         * LED 3 blinking light
         */
        if(led3_blink > 0){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need a timer for the rotation speed, only 1
                int counts[1] = {blink_rate_3};
                led3_active = activate_free_timer(1, counts, 0);
                activated_led3[0] = activated_timers[0]; //record which ones were activated
                led3_blink = activated_led3[0];
                if (led3_active != 1) { //if return is 1, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the blinking light
                    led3_blink = 0;
                    led3_active = 0;
                } else {
                    //toggle LED D3, with start colour
                    P2OUT = colours[colour];
                    //indicate on
                    led3_blink_on = 1;
                }

