fraserb99/ee579-msp430/Group Project/main.c
            }

        } else if(led3_blink == -1){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            deactivate_timer(activated_led3, 1);
            led3_blink = 0;
        }

        /**
         * LED 3 fade in
         */
        if(led3_fade_in > 0){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                P2OUT &= ~(BIT1 + BIT3 + BIT5); //don't want it on
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_3};
                led3_active = activate_free_timer(2, counts, 0);
                activated_led3[0] = activated_timers[0]; //record which ones were activated, first
                activated_led3[1] = activated_timers[1]; //record second one
                led3_fade_in = get_timer_code(activated_led3);
                if (led3_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable fade in
                    led3_fade_in = 0;
                    led3_active = 0;
                } else {
                    light_flag_3 = 0;
                    counter_val_3 = 0;
                }
            }

        } else if (led3_fade_in == -1){
            deactivate_timer(activated_led3, 2);
            led3_fade_in = 0;
        }

        /**
         * LED 3 fade out
         */
        if(led3_fade_out > 0){
            if(!led3_fo_active){ //if light hasn't been activated, or if on
                P2DIR |= BIT1 + BIT3 + BIT5;
                //need 2 timers for the fading in
                int counts[2] = {change_period, period_3};
                led3_fo_active = activate_free_timer(2, counts, 0);
                activated_led3[0] = activated_timers[0]; //record which ones were activated, first
                activated_led3[1] = activated_timers[1]; //record second one
                led3_fade_out = get_timer_code(activated_led3);
                if (led3_fo_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable fade out
                    led3_fade_out = 0;
                    led3_fo_active = 0;
                    led3_active = 0;
                } else {
                    led3_active = 1; //led is being used
                    //for testing
                    //set the brightness to max
                    brightness_3 = max_brightness;
                    light_flag_3 = 1;
                    counter_val_3 = 0;
                    //need to turn on a light first, if not already on, on the specified colour
                    P2OUT |= colours[colour];
                }

            }

        } else if (led3_fade_out == -1){
            led3_fo_active = 0;
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5);
            deactivate_timer(activated_led3, 2);
            led3_fade_out = 0;
        }

        /**
         * LED 3 breathing light
         */
        if(led3_breath > 0){
            if(!led3_active){
                P2DIR |= BIT1 + BIT3 + BIT5;
                P2OUT &= ~(BIT1 + BIT3 + BIT5); //turn all off to start
                check_breath(1);
                //need 2 timers for the breathing light
                int counts[2] = {change_period, period_3};
                led3_active = activate_free_timer(2, counts, 0);
                activated_led3[0] = activated_timers[0]; //record which ones were activated, first
                activated_led3[1] = activated_timers[1]; //record second one
                led3_breath = get_timer_code(activated_led3);
                if (led3_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the breathing light
                    led3_breath = 0;
                    led3_active = 0;
                } else {
                    light_flag_3 = 0;
                    counter_val_3 = 0;
                    lights_used[2] = 1;
                }
            }

        } else if (led3_breath == -1){
            led3_active = 0;
            P2OUT &= ~(BIT1 + BIT3 + BIT5); //turn off the light
            deactivate_timer(activated_led3, 2);
            led3_breath = 0;
            lights_used[2] = 0;
            check_breath(0);
        }

        /**
         * Buzzer on for specific duration, allocated first available timer
         */
        if(buzzer_tone > 0){
            if(!buzzer_active){ //if it's not been activated
                //activate the pins used
                P2DIR |= BIT2 + BIT4;
                P2OUT |= BIT2;     //ensure one is on, the other off
                P2OUT &= ~ BIT4;
                buzzer_count = 0;   //ensure this is at 0;
                buzzer_duration = buzzer_duration/5; //ensure duration is proper as sampling at 5ms
                //need to have 1 timer
                int counts[1] = {buzzer_period};
                buzzer_active = activate_free_timer(1, counts, 0);
                activated_buzzer[0] = activated_timers[0]; //record which one were activated
                buzzer_tone = activated_buzzer[0]; //get the timer
                if (buzzer_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the buzzer
                    buzzer_tone = 0;
                    buzzer_active = 0;
                }
            }
        } else if (buzzer_tone == -1){
            buzzer_active = 0;  //no longer on
            P2OUT &= ~BIT2;
            P2OUT &= ~BIT4;
            deactivate_timer(activated_buzzer, 1);
            buzzer_tone = 0;
        }

        /**
         * Buzzer beeping at specified rate, continues until turned off
         */
        if(buzzer_beep > 0){
            if(!buzzer_active){ //if it's not been activated
                //activate the pins used
                P2DIR |= BIT2 + BIT4;
                P2OUT |= BIT2;     //ensure one is on, the other off
                P2OUT &= ~ BIT4;
                buzzer_count = 0;   //ensure this is at 0;
                buzzer_duration = buzzer_duration/5; //ensure duration is proper
                buzzer_duration_off = buzzer_duration_off/5; //ensure duration is proper
                //need to have 1 timer
                int counts[1] = {buzzer_period};
                buzzer_active = activate_free_timer(1, counts, 0);
                activated_buzzer[0] = activated_timers[0]; //record which one were activated
                buzzer_beep = activated_buzzer[0];
                if (buzzer_active == 0) { //if return is anything but 0, has now been activated
                    //something went wrong
                    send_message = 1;
                    send[0][0] = 1; //set flag
                    send[1][0] = 1; //generic
                    //disable the buzzer
                    buzzer_beep = 0;
                    buzzer_active = 0;
                }
            }

        } else if (buzzer_beep == -1){
            buzzer_active = 0;  //no longer on
            P2OUT &= ~BIT2;
            P2OUT &= ~BIT4;
            deactivate_timer(activated_buzzer, 1);
            buzzer_beep= 0;
        }

