fraserb99/ee579-msp430/Group Project/main.c
    }
}

/**interrupts,
 * duplicated code to allow for optimum timer usage
 *
 * timer A0 is reserved for UART
 */

#pragma vector=TIMER0_A0_VECTOR
__interrupt void Timer0_A0 (void)
{
    //TODO: insert uart code here
    //UART stuff here, generic timer nr for now
    TA0CCR0 += 16384;
}

//interrupt for timer A0_1,2 and overflow
#pragma vector=TIMER0_A1_VECTOR
__interrupt void Timer0_A1(void){
    switch(TA0IV)
    {
    case  2:
        /**
         * Button interrupt, checks for duration of press and acts as debouncer
         */
        //check for how long button was pressed
        if ((button == 1) && (held == 1)) {
            if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
                timer_count += 1;
                //offset TA0CCR1 by the count number/period
                TA0CCR1 += count_b;
            } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
                //send message for how long the button was held for
                send_message = 1;
                send[0][1] = 1; //set flag
                send[1][1] = timer_count; //the time held

                //wanted output for testing should be set here, some were used during initial testing, uncomment for use
                //led2_breath = 1;
                //led2_fade_out = 1;
                //buzzer_beep = -1;
                held = 0;                               //button has now been released
                //set timer count to 0
                TA0CCR1 = 0;
            }

        } else if (button == 1){ //check that it is the button debouncing
            if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
                 timer_count = 0;                     //Reset the timer count
                 pressed = 0;                        //reset pressed
                 held = 1;                           //Button is being held
                 //P1OUT ^= BIT6;
                 //offset TA0CCR0 by the count number/period
                 //change the value held in the array
                 timers_used[0][1] = count_b;
                 TA0CCR1 += count_b;

            } else {
                pressed = 0;                         //Button is not being pressed
            }

         }

        //button 2, copied code fom button 1
        if ((button2 == 1) && (held2 == 1)) {
            if ((held2 == 1) && !(P1IN & BIT5)) { //check how long its being held for
                timer_count2 += 1;
                //offset TA0CCR1 by the count number/period
                TA0CCR1 += count_b2;
            } else if ((held2 == 1) && (P1IN & BIT5)){   //if button was released
                //send message for how long the button was held for
                send_message = 1;
                send[0][1] = 1; //set flag
                send[1][1] = timer_count2; //the time held

                //testing outputs should be activated here
                //buzzer_beep = -1;

                held2 = 0;                               //button has now been released

                TA0CCR1 = 0;
            }

        } else if (button2 == 1){ //check that it is the button debouncing
            if ((pressed2 == 1) && !(P1IN & BIT5)){   //button was pressed properly
                 timer_count2 = 0;                    //Reset the timer count
                 pressed2 = 0;                        //reset pressed
                 held2 = 1;                           //Button is being held
                 //offset TA0CCR0 by the count number/period
                 //change the value held in the array
                 timers_used[0][1] = count_b2;
                 TA0CCR1 += count_b2;

            } else {
                pressed2 = 0;                         //Button is not being pressed
            }

         }

        /**
         * Potentiometer for stabilisation and sample rate
         */
        if(pot == 1){
            if (!stable_pot){

                //get original value, if possible here
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                orig_val = ADC10MEM;

                //update timer value
                timers_used[0][1] = sample_time;
                stable_pot = 1;

            } else {
                sample_pot = 1;        //start a sample
            }

            TA0CCR1 += sample_time;
        }


        /**
         * Thermometer, for stabilisation and sampling rate
         */
        if(thermometer == 1){
            if (!stable){
                stable = 1;
                //get original value, if possible here
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                temp = ADC10MEM;
                // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
                orig_temp = ((temp - 673) * 423) / 1024;

                //update timer value
                timers_used[0][1] = sample_temp_time;

            } else {
                sample_temp = 1;        //start a sample
            }

            TA0CCR1 += sample_temp_time;
        }

        /**
         * Output interrupts
         */
        /**
         * LED 1 blinking
         */
        if(led1_blink == 1){
            P1OUT ^= BIT0;
            TA0CCR1 += blink_rate_1;
        }

        /**
         * LED 1 fading in/out and breathing, part 1, can only be 10
         */
        if((led1_fade_in == 10) || (led1_fade_out == 10) || (led1_breath == 10)){
            if(counter_val_1 < brightness_1){
                P1OUT |= BIT0;                              //Turn on light
            } else {
                P1OUT &= ~BIT0;
            }
            counter_val_1 += 1;                             //Increment the value to read from the array

            if(counter_val_1 >= max_brightness){                       //reached max value, reset
                counter_val_1 = 0;
            }
            TA0CCR1 += change_period;
        }

        /**
         * LED2 blinking
         */
        if(led2_blink == 1){
            P1OUT ^= BIT6;
            TA0CCR1 += blink_rate_2;
        }

        /**
         * LED 2 fading in/out and breathing, part 1, can only be 10
         */
        if((led2_fade_in == 10) || (led2_fade_out == 10) || (led2_breath == 10)){
            if(counter_val_2 < brightness_2){
                P1OUT |= BIT6;                              //Turn on light
            } else {
                P1OUT &= ~BIT6;
            }
            counter_val_2 += 1;                             //Increment the value to read from the array

            if(counter_val_2 >= max_brightness){                       //reached max value, reset
                counter_val_2 = 0;
            }
            TA0CCR1 += change_period;
        }

        /**
         * LED3 rotating
         */
        if(led3_rot == 1){
            //verify boundaries
            if ((colour == 0) && (led3_dir == -1)){
                colour = 5;
            } else if ((colour == 5) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            //swap colour
            P2OUT = colours[colour];
            TA0CCR1 += blink_rate_3;
        }

        /**
         * LED3 blink
         */
        if(led3_blink == 1){
            if(led3_blink_on){
                P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
                led3_blink_on = 0;
                TA0CCR1 += blink_rate_3;
            } else {
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 5;
                } else if ((colour == 5) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
                led3_blink_on = 1;
                //swap colour
                P2OUT = colours[colour];
                TA0CCR1 += blink_rate_3;
            }
        }

        /**
         * LED 3 fading in/out and breathing, part 1, 10
         */
        if((led3_fade_in == 10) || (led3_fade_out == 10) || (led3_breath == 10)){
            if(counter_val_3 < brightness_3){
                P2OUT |= colours[colour];                              //Turn on light
            } else {
                P2OUT &= ~(BIT1 + BIT3 + BIT5);
            }
            counter_val_3 += 1;                             //Increment the value to read from the array

