fraserb99/ee579-msp430/Group Project/main.c
            if(counter_val_3 >= max_brightness){                       //reached max value, reset
                counter_val_3 = 0;
            }
            TA0CCR1 += change_period;
        }

        /**
         * Buzzer tone
         */
        if(buzzer_tone == 1){
            buzzer_count += 1;  //increment count
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;

            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration){
                buzzer_tone = -1; //turn it off
            }

            TA0CCR1 += buzzer_period;
        }

        /**
         * Buzzer Beeping
         */
        if(buzzer_beep == 1){
            buzzer_count += 1;  //increment count

            if(buzzer_on) { //if it is on, alternate
                //alternate the pins
                P2OUT ^= BIT2;
                P2OUT ^= BIT4;
                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration){
                    buzzer_on = 0; //turn off
                    buzzer_count = 0; //reset count
                }

            } else { //if off, turn both off
                P2OUT &= ~BIT2;
                P2OUT &= ~BIT4;

                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration_off){
                    buzzer_on= 1; //turn it on
                    //buzzer count reset
                    buzzer_count = 0;
                    //turn one of them on
                    P2OUT |= BIT2;
                }

            }


            TA0CCR1 += buzzer_period;
        }

        break;
    case 4:
        /**
         * Copied interrupts from above, with altered timer registers,
         * with some added functions for fading and breathing as they require 2 CCRs
         */
        //check for how long button was pressed
        if ((button == 2) && (held == 1)) {
            if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
                timer_count += 1;
                //offset TA0CCR0 by the count number/period
                TA0CCR2 += count_b;
            } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
                //send message for how long the button was held for
                send_message = 1;
                send[0][1] = 1; //set flag
                send[1][1] = timer_count; //the time held

                //led3_rot = 1;
                //testing with light first
               // P1OUT ^= BIT0;
                held = 0;                               //button has now been released
                TA0CCR2 = 0;
            }

        } else if (button == 2){ //check that it is the button debouncing
            if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
                 timer_count = 0;                     //Reset the timer count
                 pressed = 0;                        //reset pressed
                 held = 1;                           //Button is being held

                 //change the value held in the array
                 timers_used[0][2] = count_b;
                 TA0CCR2 += count_b;

            } else {
                pressed = 0;                         //Button is not being pressed
            }

         }

        //button 2, copied code
        if ((button2 == 2) && (held2 == 1)) {
            if ((held2 == 1) && !(P1IN & BIT5)) { //check how long its being held for
                timer_count2 += 1;
                //offset TA0CCR0 by the count number/period
                TA0CCR2 += count_b2;
            } else if ((held2 == 1) && (P1IN & BIT5)){   //if button was released
                //send timer count signal here
                send_message = 1;
                send[0][1] = 1; //set flag
                send[1][1] = timer_count2; //the time held

                //testing values for second button
                //led3_breath = 1;
                //buzzer_beep = -1;
                held2 = 0;                               //button has now been released
                TA0CCR2 = 0;
            }

        } else if (button2 == 2){ //check that it is the button debouncing
            if ((pressed2 == 1) && !(P1IN & BIT5)){   //button was pressed properly
                 timer_count2 = 0;                     //Reset the timer count
                 pressed2 = 0;                        //reset pressed
                 held2 = 1;                           //Button is being held

                 //change the value held in the array
                 timers_used[0][2] = count_b2;
                 TA0CCR2 += count_b2;

            } else {
                pressed2 = 0;                         //Button is not being pressed
            }

         }

        //pot stuff
        if(pot == 2){
            if (!stable_pot){

                //get original value, if possible here
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                orig_val = ADC10MEM;

                //update timer value
                timers_used[0][2] = sample_time;
                stable_pot = 1;

            } else {
                sample_pot = 1;        //start a sample
            }

            TA0CCR2 += sample_time;
        }


        //thermometer stuff
        if(thermometer == 2){
            if (!stable){
                stable = 1;
                //get original value, if possible here
                ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
                temp = ADC10MEM;
                // oC = ((A10/1024)*1500mV)-986mV)*1/3.55mV = A10*423/1024 - 278, taken from example
                orig_temp = ((temp - 673) * 423) / 1024;

                //update timer value
                timers_used[0][2] = sample_temp_time;

            } else {
                sample_temp = 1;        //start a sample
            }

            TA0CCR2 += sample_temp_time;
        }

