fraserb99/ee579-msp430/Group Project/main.c
    //fading in/out and breathing, part 1, can be 11 or 12
    if(((led2_fade_in == 11) || (led2_fade_in == 12)) || ((led2_fade_out == 11) || (led2_fade_out == 12)) || ((led2_breath == 11) || (led2_breath == 12))){
        if(counter_val_2 < brightness_2){
            P1OUT |= BIT6;                              //Turn on light
        } else {
            P1OUT &= ~BIT6;
        }
        counter_val_2 += 1;                             //Increment the value to read from the array

        if(counter_val_2 >= max_brightness){                       //reached max value, reset
            counter_val_2 = 0;
        }
        TA1CCR0 += change_period;
    }

    //LED3 rotating
    if(led3_rot == 3){
        //verify boundaries
        if ((colour == 0) && (led3_dir == -1)){
            colour = 5;
        } else if ((colour == 5) && (led3_dir == 1)){
            colour = 0;
        } else {
            colour = colour + led3_dir; //change colour based on direction
        }
        //swap colour
        P2OUT = colours[colour];
        TA1CCR0 += blink_rate_3;
    }
    //LED3 blink
    if(led3_blink == 3){
        if(led3_blink_on){
            P2OUT &= ~(BIT1 + BIT3 + BIT5);     //turn light off
            led3_blink_on = 0;
            TA1CCR0 += blink_rate_3;
        } else {
            if ((colour == 0) && (led3_dir == -1)){
                colour = 5;
            } else if ((colour == 5) && (led3_dir == 1)){
                colour = 0;
            } else {
                colour = colour + led3_dir; //change colour based on direction
            }
            led3_blink_on = 1;
            //swap colour
            P2OUT = colours[colour];
            TA1CCR0 += blink_rate_3;
        }
    }

    //fading in/out and breathing, part 1, can be 11 or 12
    if(((led3_fade_in == 11) || (led3_fade_in == 12)) || ((led3_fade_out == 11) || (led3_fade_out == 12)) || ((led3_breath == 11) || (led3_breath == 12))){
        if(counter_val_3 < brightness_3){
            P2OUT |= colours[colour];                              //Turn on light
        } else {
            P2OUT &= ~(BIT1 + BIT3 + BIT5);
        }
        counter_val_3 += 1;                             //Increment the value to read from the array

        if(counter_val_3 >= max_brightness){                       //reached max value, reset
            counter_val_3 = 0;
        }
        TA1CCR0 += change_period;
    }


    //Buzzer
    if(buzzer_tone == 3){
        buzzer_count += 1;  //increment count
        //alternate the pins
        P2OUT ^= BIT2;
        P2OUT ^= BIT4;

        //check if less or greater than the wanted duration
        if(buzzer_count >= buzzer_duration){
            buzzer_tone = -1; //turn it off
        }

        TA1CCR0 += buzzer_period;
    }

    //buzzer beeping
    if(buzzer_beep == 3){
        buzzer_count += 1;  //increment count

        if(buzzer_on) { //if it is on, alternate
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;
            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration){
                buzzer_on = 0; //turn off
                buzzer_count = 0; //reset count
            }

        } else { //if off, turn both off
            P2OUT &= ~BIT2;
            P2OUT &= ~BIT4;

            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration_off){
                buzzer_on= 1; //turn it on
                //buzzer count reset
                buzzer_count = 0;
                //turn one of them on
                P2OUT |= BIT2;
            }

        }


        TA1CCR0 += buzzer_period;
    }
}

//interrupt for timerA1, based on previous timers
#pragma vector=TIMER1_A1_VECTOR
__interrupt void Timer1_A1(void){
    switch(TA1IV)
    {
    case  2:
        //check for how long button was pressed
        if ((button == 4) && (held == 1)) {
            if ((held == 1) && !(P1IN & BIT3)) { //check how long its being held for
                timer_count += 1;
                //offset TA1CCR1 by the count number/period
                TA1CCR1 += count_b;
            } else if ((held == 1) && (P1IN & BIT3)){   //if button was released
                //send timer count signal here
                send_message = 1;
                send[0][1] = 1; //set flag
                send[1][1] = timer_count; //the time held

                led1_blink = 1;
                //testing with light first
               // P1OUT ^= BIT0;
                held = 0;                               //button has now been released
                TA1CCR1 = 0;
            }

        } else if (button == 4){ //check that it is the button debouncing
            if ((pressed == 1) && !(P1IN & BIT3)){   //button was pressed properly
                 timer_count = 0;                     //Reset the timer count
                 pressed = 0;                        //reset pressed
                 held = 1;                           //Button is being held
                 P1OUT ^= BIT6;
                 //offset TA0CCR0 by the count number/period
                 //change the value held in the array
                 timers_used[0][4] = count_b;
                 TA1CCR1 += count_b;

            } else {
                pressed = 0;                         //Button is not being pressed
            }

         }

        //button 2, copied code
        if ((button2 == 4) && (held2 == 1)) {
            if ((held2 == 1) && !(P1IN & BIT5)) { //check how long its being held for
                timer_count2 += 1;
                //offset TA0CCR0 by the count number/period
                TA1CCR1 += count_b2;
            } else if ((held2 == 1) && (P1IN & BIT5)){   //if button was released
                //send timer count signal here
                send_message = 1;
                send[0][1] = 1; //set flag
                send[1][1] = timer_count2; //the time held

                held2 = 0;                               //button has now been released
                TA1CCR1 = 0;
            }

        } else if (button2 == 4){ //check that it is the button debouncing
            if ((pressed2 == 1) && !(P1IN & BIT5)){   //button was pressed properly
                 timer_count2 = 0;                     //Reset the timer count
                 pressed2 = 0;                        //reset pressed
                 held2 = 1;                           //Button is being held
                 //change the value held in the array
                 timers_used[0][4] = count_b2;
                 TA1CCR1 += count_b2;

            } else {
                pressed2 = 0;                         //Button is not being pressed
            }

