fraserb99/ee579-msp430/Group Project/main.c
             if(brightness_3 == 0) {       //reached lowest value
                P2OUT &= ~(BIT1 + BIT3 + BIT5); //keep light off
                led3_fade_out = -1;          //completed task, deactivate it
            }

            TA1CCR2 += period_3;
        }

        //breathing part 2, can be 12 or 13
        if((led3_breath == 12) || (led3_breath == 13)){
            if(light_flag_3 == 0){
                brightness_3 += 1;                //increase brightness
            } else {
                brightness_3 -= 1;                //decrease brightness
            }

            if(brightness_3 == max_brightness){               //if max brightness
                light_flag_3 = 1;                //set to decrease
            } else if (brightness_3 == 0) {       //reached lowest value
                light_flag_3 = 0;                //increase light
                //change colour
                //verify boundaries
                if ((colour == 0) && (led3_dir == -1)){
                    colour = 5;
                } else if ((colour == 5) && (led3_dir == 1)){
                    colour = 0;
                } else {
                    colour = colour + led3_dir; //change colour based on direction
                }
            }

            TA1CCR2 += period_3;
        }

        //buzzer
        if(buzzer_tone == 5){
            buzzer_count += 1;  //increment count
            //alternate the pins
            P2OUT ^= BIT2;
            P2OUT ^= BIT4;

            //check if less or greater than the wanted duration
            if(buzzer_count >= buzzer_duration){
                buzzer_tone = -1; //turn it off
            }

            TA1CCR2 += buzzer_period;
        }

        //buzzer beeping
        if(buzzer_beep == 5){
            buzzer_count += 1;  //increment count

            if(buzzer_on) { //if it is on, alternate
                //alternate the pins
                P2OUT ^= BIT2;
                P2OUT ^= BIT4;
                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration){
                    buzzer_on = 0; //turn off
                    buzzer_count = 0; //reset count
                }

            } else { //if off, turn both off
                P2OUT &= ~BIT2;
                P2OUT &= ~BIT4;

                //check if less or greater than the wanted duration
                if(buzzer_count >= buzzer_duration_off){
                    buzzer_on= 1; //turn it on
                    //buzzer count reset
                    buzzer_count = 0;
                    //turn one of them on
                    P2OUT |= BIT2;
                }

            }


            TA1CCR2 += buzzer_period;
        }
        break;


    case 10: break;                             //Timer_A3 overflow, don't need to do anything

    }

}

//Interrupt for the button, based on the slides/previous task
#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void){
    //if it was the button that was pressed
    if(P1IFG & BIT3){
        pressed = 1;                            //Turn on flag for debouncer/check if button was pressed properly
        //debouncer timer, based on current count, check which one was used
        switch(button){//Current count plus the wanted debounce part
        case 1:
            TA0CCR1 = TAR + debounce_b;
            break;
        case 2:
            TA0CCR2 = TAR + debounce_b;
            break;
        case 3:
            TA1CCR0 = TAR + debounce_b;
            break;
        case 4:
            TA1CCR1 = TAR + debounce_b;
            break;
        case 5:
            TA1CCR2 = TAR + debounce_b;
            break;
        }

        P1IFG &= ~BIT3;                             //clear flag
    } else if(P1IFG & BIT5){ //if it was button 2
        pressed2 = 1;
        //debouncer timer, based on current count, check which one was used
        switch(button2){
        case 1:
            TA0CCR1 = TAR + debounce_b2;
            break;
        case 2:
            TA0CCR2 = TAR + debounce_b2;
            break;
        case 3:
            TA1CCR0 = TAR + debounce_b2;
            break;
        case 4:
            TA1CCR1 = TAR + debounce_b2;
            break;
        case 5:
            TA1CCR2 = TAR + debounce_b2;
            break;
        }
        P1IFG &= ~BIT5;                             //clear flag
    }


}


/**
 * Helper functions
 */

/**
 * Activation of features, reads and parses messages
 * TODO: Input the actual function for this here
 */

    //so need to change the values of the wanted outputs
    //only listing those that needs changing

    //if LED blink:
        //change period of led:
        //blink_rate_x = (32768*value)/4000;
    //if LED breath, or fade:
        //need to round period to closest frequency can have 1Hz, 2HZ or 4Hz = 1s, 0.5s, 0.25ms
        //actually that is a value of 2000ms, 1000ms or 500ms
        //so any value given needs to be close to either, suggestion is:
        //if value > 1500 set to 1Hz, if 1500 > value > 750 set to 2Hz, if value < 750 set to 4hz
        //so period_x = brightness_register_y, where x is the led and y is 1 - 1Hz, 2 - 2Hz, or 3 - 4Hz for the settings
    //if LED3 rot:
        //period is set to that of the value so
        //blink_rate_3 = (32768*value)/2000;
    //for buzzer there is no need for calculations
    //if buzzer on:
        //buzzer_duration = value (in ms)
    //if buzzer beep: (all in ms)
        //buzzer_duration = value_on
        //buzzer_duration_off = value_off

    //to set the colour of the third LED the colour variable needs to be set to a number between 0 and 5
    //the array looks like {RED, GREEN, BLUE, YELLOW, PURPLE, WHITE} where colour reflect index
    //so colour = 2 is blue

/**
 * function for activating a specific timer, takes in the wanted timer to activate and the CCR value to use
 * returns 1 if successful. else 0
 */
int activate_timer(int timer_no, int count){
    if(timer_no == 0){
        TA0CTL = TASSEL_1 + MC_2 + TAIE;          // ACLK, continuous mode, interrupt enabled
        TA0CCTL0 |= CCIE;                         // TA0CCR0 interrupt enabled
        TA0CCR0 = count;

        timers_used[0][0] = count;
        timers_used[1][0] = 1;
        timer0_activated = 1;
        return 1;
    } else if (timer_no == 1){
        TA1CTL = TASSEL_1 + MC_2 + TAIE;          // ACLK, continuous mode, interrupt enabled
        TA1CCTL0 |= CCIE;

