fraserb99/ee579-msp430/Group Project/main.c
        TA1CCR0 = count;
        timers_used[0][3] = count;
        timers_used[1][3] = 1;

        timer1_activated = 1;
        return 1;
    }

    return 0;

}

/**
 * function for checking which timer is free, takes in the number of CCR registers wanted,
 * an array for the counts to use for the registers, and a boolean to indicate if the timer needs to be on its own
 * if alone is 1 then requested CCR needs to be on its own, else can share
 * Prioritises activation of timers with same CCR value that are not specified as alone
 * returns 1 for success, otherwise 0. changes the activated_timers array to indicate which timers were activated
 */
int activate_free_timer(int registers, int counts[], int alone){
    //check which registers are free, if less than the register amount, return error
    int potential[2] = {}; //potential registers, second row is the value held in the register
    int to_activate[2] = {0, 0}; //registers to activate
    unsigned int index = 0;
    unsigned int i, r;

    //check how many registers there are, currently max is 2
    if(registers == 1) {
        //loop through and look first for registers with the same counts, unless the timer should be alone
        if(alone) {
            for(i=0; i<5; i++){
                if(timers_used[0][i] == 0){
                   to_activate[0] = i;
                   index = 1; //found one
                   break; //no need to look for others
               }
            }

            //check that one was actually found
            if(index == 0) {
                //error
                return 0;
            } //else its fine, just continue
        } else { //can look for evidence of same register value, if free
            for(i=0; i<5; i++){
                //check that the timer is available for others
               if((timers_used[0][i] == counts[0]) && (timers_used[1][i] != -1)){
                  to_activate[0] = i;
                  index = 1;
                  break; //break out as one was found
               }
            }
            //if none was found, check for free ones
            if(index == 0) {
                for(i=0; i<5; i++){
                    //check for first free timer
                   if(timers_used[0][i] == 0){
                      to_activate[0] = i;
                      index = 1;
                      break; //break out as one was found
                   }
                }
            }
            //check that one was actually found, otherwise return 0
            if(index == 0){
                return 0;
            }
        }

    } else if (registers == 2){ //shouldn't have any that needs to be alone
        //check registers for ones with same period
        for(r=0; r<2; r++){
            for(i=0; i<5; i++){
                //check that the timer is available for others
               if((timers_used[0][i] == counts[r]) && (timers_used[1][i] != -1)){
                   if(r == 0){ //if first register
                       //need to verify that it is either 1, 3, or 4
                       if((i == 1) || (i == 3) || (i == 4)){
                           potential[0] = i;
                           index++;
                           break; //break out as one was found
                       } //if not invalid option
                   } else {
                       //need to verify that it is either 2, 4, or 5
                      if((i == 2) || (i == 4) || (i == 5)){
                          potential[1] = i;
                          index++;
                          break; //break out as one was found
                      } //if not invalid option
                   }
               }
            }
            //if none were found check for free one
            if(r == 0) {
                if(index == 0){
                    for(i=0; i<5; i++){
                       if(timers_used[0][i] == 0){
                           if((i == 1) || (i == 3) || (i == 4)){
                              potential[0] = i;
                              index++;
                              break; //break out as one was found
                          } //if not, invalid option
                       }
                    }
                }
            } else {
                if(index == 1){
                    for(i=0; i<5; i++){
                       if(timers_used[0][i] == 0){
                           //also need to check what the first potential one
                           if(potential[0] == 1){
                               if(i == 2){
                                   potential[1] = i;
                                   index++;
                                   break; //break out as one was found
                               }
                           } else if(potential[0] == 3){
                               if((i == 4) || (i == 5)){
                                   potential[1] = i;
                                   index++;
                                   break; //break out as one was found
                               }

                          } else if(potential[0] == 4){
                              if(i == 5){
                                  potential[1] = i;
                                  index++;
                                  break; //break out as one was found
                              }
                          }
                       }
                    }
                }
            }
        }

        //need to verify that 2 was found
        if(index != 2){
            return 0;
        } else { //if 2 were actually found then verify them
            //allowed combo: 1+2, 3+4, 3+5, 4+5
            if(potential[0] == 1){
                if(potential[1] == 2){
                    to_activate[0] = 1;
                    to_activate[1] = 2;
                } else {
                    return 0; //no valid match
                }
            } else if(potential[0] == 3){
                if(potential[1] == 4){
                    to_activate[0] = 3;
                    to_activate[1] = 4;
                } else if(potential[1] == 5) {
                    to_activate[0] = 3;
                    to_activate[1] = 5;
                } else {
                    //invalid match
                    return 0;
                }
            } else if(potential[0] == 4){
                if(potential[1] == 5){
                    to_activate[0] = 4;
                    to_activate[1] = 5;
                } else {
                    //invalid combo
                    return 0;
                }
            } else {
                //something went wrong, should actually never reach this
                return 0;
            }

