fraserb99/ee579-msp430/Group Project/main.c
        }

    }

    //if reached here then its fine

    ///reset activated timers
    activated_timers[0] = -1;
    activated_timers[1] = -1;

    //activate them
    for (i=0; i < registers; i++){
        //need to ensure that if more than 1 register are needed that they are from the same timer
        switch (to_activate[i]){
        case 0: //should never be reached, reserved timer
            return 0;
        case 1:
            //activate A0_1
            //if A0_0 wasn't available then A0 was already activated so don't need to check again
            if(timers_used[0][1] == 0){
                TA0CCTL1 |= CCIE;
                TA0CCR1 = counts[i];
            }
            //set it as active
            timers_used[0][1] = counts[i];
            //update count
            if(alone){
                timers_used[1][1] = -1;
            } else {
                timers_used[1][1] = timers_used[1][1] + 1;
            }
            //set it as activated
            activated_timers[i] = 1;
            break;
        case 2:
            //activate A0_2
            if(timers_used[0][2] == 0){
                TA0CCTL2 |= CCIE;
                TA0CCR2 = counts[i];
            }
            //set it as active
            timers_used[0][2] = counts[i];
            //update count
            if(alone){
                timers_used[1][2] = -1;
            } else {
                timers_used[1][2] = timers_used[1][2] + 1;
            }
            //set it as activated
            activated_timers[i] = 2;
            break;
        case 3:
            //activate A1_0check if A1 is already active
            if(!timer1_activated){
                activate_timer(1, counts[i]);
            } else if(timers_used[0][3] == 0) {
                TA1CCTL0 |= CCIE;
                TA1CCR0 = counts[i];
                timers_used[1][3] = timers_used[1][3] + 1;
            } else {
                //if already active, just increase nr of functions
                timers_used[1][3] = timers_used[1][3] + 1;
            }
            //set it as active
            timers_used[0][3] = counts[i];
            //update count
            if(alone){
                timers_used[1][3] = -1;
            } //already been activated otherwise
            //set it as activated
            activated_timers[i] = 3;
            break;
        case 4:
            //activate A1_1
            if(timers_used[0][4] == 0){
               TA1CCTL1 |= CCIE;
               TA1CCR1 = counts[i];
            }

            //set it as active
            timers_used[0][4] = counts[i];
            //update count
            if(alone){
                timers_used[1][4] = -1;
            } else {
                timers_used[1][4] = timers_used[1][4] + 1;
            }
            //set it as activated
            activated_timers[i] = 4;
            break;
        case 5:
            //activate A1_2
            if(timers_used[0][5] == 0){
                TA1CCTL2 |= CCIE;
                TA1CCR2 = counts[i];
            }
            //set it as active
            timers_used[0][5] = counts[i];
            //update count
            if(alone){
                timers_used[1][5] = -1;
            } else {
                timers_used[1][5] = timers_used[1][5] + 1;
            }
            //set it as activated
            activated_timers[i] = 5;
            break;
        default:
            return 0;
        }
    }
    //success
    return 1;

}

/**
 * function to turn off the timers activated - or set the count value to 0,
 * Takes in the array of activated timers, and the length of the array
 * check if each value is now zero so the full timer should be turned off
 * returns nothing, changes the timers_used array to reflect the deactivations
 */
void deactivate_timer(int activated[], int len){
    unsigned int i;
    for(i=0; i < len; i++){
        int deactivate = activated[i];
        //need to ensure that the timer isn't used by others, and need to see if it is designated as alone
        //so check for > 0, as -1 needs to be set to 0 as well

        switch (deactivate){ //deactivate specific timer count register
        case 0:
            //should not be reached
            break;
        case 1:
            if(timers_used[1][1] > 1){ //assuming at least 1 as it will be deactivated
                //reduce by 1
                timers_used[1][1] = timers_used[1][1] - 1;
            } else {
                TA0CCR1 = 0;
                timers_used[0][1] = 0;
                timers_used[1][1] = 0;
            }
            break;
        case 2:
            if(timers_used[1][2] > 1){ //assuming at least 1 as it will be deactivated
                //reduce by 1
                timers_used[1][2] = timers_used[1][2] - 1;
            } else {
                TA0CCR2 = 0;
                timers_used[0][2] = 0;
                timers_used[1][2] = 0;
            }
            break;
        case 3:
            if(timers_used[1][3] > 1){ //assuming at least 1 as it will be deactivated
                //reduce by 1
                timers_used[1][3] = timers_used[1][3] - 1;
            } else {
                TA1CCR0 = 0;
                timers_used[0][3] = 0;
                timers_used[1][3] = 0;
            }
            break;
        case 4:
            if(timers_used[1][4] > 1){ //assuming at least 1 as it will be deactivated
                //reduce by 1
                timers_used[1][4] = timers_used[1][4] - 1;
            } else {
                TA1CCR1 = 0;
                timers_used[0][4] = 0;
                timers_used[1][4] = 0;
            }
            break;
        case 5:
            if(timers_used[1][5] > 1){ //assuming at least 1 as it will be deactivated
                //reduce by 1
                timers_used[1][5] = timers_used[1][5] - 1;
            } else {
                TA1CCR2 = 0;
                timers_used[0][5] = 0;
                timers_used[1][5] = 0;
            }
            break;
        }
    }

