fraserb99/ee579-msp430/Group Project/main.c
    //check if all registers for A1 is 0
    int all_1 = 0;
        for(i=3; i<6; i++){
            if(timers_used[0][i] == 0){
                all_1++;
            }
        }

        if(all_1 == 3){
            TA1CTL = MC_0;      //turn off A0
            timer1_activated = 0;
        }
}

/**
 * Function that returns the "code"/designated number for those who uses 2 timers
 * takes in the array of timers activated
 * returns 0 if something went wrong
 */
int get_timer_code(int timers[]){
    int first = timers[0];
    int second = timers[1];

    switch (first){ //check which timer is first
    //first timers can only be 1, 3, and 4
    case 1:
        //get second value, should be 2
        if(second == 2){
             return 10;
        } else {
            //something went wrong, send error message
            send_message = 1;
            send[0][0] = 1;
            send[1][0] = 1; //generic
        }
        break;
    case 3:
        //get second value
        if(second == 4){
            return 11;
        } else if (second == 5){
            return 12;
        } else {
            //something went wrong, send error message
            send_message = 1;
            send[0][0] = 1;
            send[1][0] = 1; //generic
        }
        break;
    case 4:
        if(second == 5){
            return 13;
        } else {
            //something went wrong, send error message
            send_message = 1;
            send[0][0] = 1;
            send[1][0] = 1; //generic
        }
        break;
    default:
        //something went wrong, send error message
        send_message = 1;
        send[0][0] = 1;
        send[1][0] = 1; //generic
        break;
    }
    return 0; //error occurred.
}

/**
 * Small function to assist with improving breathing light functionality
 * when 1 or more breathing lights are being used, takes in a boolean to
 * indicate if this is after a LED has been turned on or off
 * returns nothing
 */
void check_breath(int on){
    //check if more than 1 breathing light is currently active
    unsigned int i;
    int active = 0;
    for(i=0; i<3; i++){
        if(lights_used[i] != 0){
            active++;
        }
    }

    if(active == 1){
        //if one was active, change to other value
        if(on){
            max_brightness = max_brightness2;
            change_period = change_period2;

            //need to reflect this in the registers, need to find which register is being used first
            for(i=0; i<5; i++){ //check for original change period
                if(timers_used[0][i] == change_period1){
                    timers_used[0][i] = change_period2;
                }
            }

        } else { //there should be a reduced number of LEDs so if there is only 1 then reset to base values
            max_brightness = max_brightness1;
            change_period = change_period1;

            //need to reflect this in the registers, need to find which register is being used first
            for(i=0; i<5; i++){ //check for original change period
                if(timers_used[0][i] == change_period2){
                    timers_used[0][i] = change_period1;
                }
            }
        }


    } //if other assume this has already been changed

}


